"""
	Создать колоду:
		карта:
			масть (черви, буби, пики, крести)
			цена (6-14)

	Перемешать колоду

	Разделить колоду на карты игрока и компа

	Раунд:
		Выбрасываем карту игрока
		Выбрасываем карту компа

		игрок > компа:
			игрок забирает себе обе карты

		игрок < комп:
			комп забирает себе обе карты

		икрок == комп (спор):
			выбрасываем снова

	Выигрыш и проигрыш:
		кончились карты
		нечем ответить в споре

"""

def make_deck() -> list:

	return []


[{} {} {}]
